# assigrment Operator กำหนดค่า คือ เครื่องหมาย =  
# การทำงานของ = คิอ เอาทวาขวาไปใส่ทางซ้าย
# ยกเว้นเสียแต่ว่า สิ่งที่อยู่ทางขวามีการทำงานใดๆ ให้ทำให้เสร็จแล้วเอาผลไปใส่ทางซ้าย
# ตัวแปร (Varoable) = ช้อมูล (Data) /นิพจน์ (Expression)
# *** ตัวแปรคือ (Varoable) คือชื่อที่ Dev. ตั้งขึ้นมาเองเอาไว้เก็บข้อมูล ***
# *** การใช้งานตัวแปร คือ เอาข้อมูลไปใส่ในตัวแปร หรือ เอาข้อมูลที่มันเก็บอยู่มาใข้ ***

score = 20 
fullname = 'สมชาย'
salary = input('ป้อนเงินเดือน: ')
sum =  20 +30 
print('-----------------------------------------')

num = 10 
num += 10
num -= 10
num *= 10
num /= 10
num %= 10
num //= 10 
print(num)
print('--------------------------------------------')