#โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 
# ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" 
# โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์

print('-------------------------------------')
print('ตรวจสอบสภาพรถ')
print('----------------------------------------------------')
car_owner = input('ป้อนชื่อเจ้าของรถ : ')
car_number = (input('ป้อนทะเบียนรถ : '))
car_carbon = float(input('ป้อนน้ำหนักชองรถ : '))
print('-------------------------------------------------------------')
if car_carbon > 1000 :
    print(f'รถทะเบียน {car_number} ของคุณ {car_owner} ไม่ผ่านเกณฑ์')
    print('รถทะเบียน {} ของคุณ {} ไม่ผ่านเกณฑ์'.format(car_number, car_owner))
else:
    print(f'รถทะเบียน {car_number} ของคุณ {car_owner} ผ่านเกณฑ์')
    print('รถทะเบียน {} ของคุณ {} ผ่านเกณฑ์'.format(car_number, car_owner))
print('-----------------------------------')
print('ขอบคุณที่ใช้บริการ')
