# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ
#  ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน

print('-------------------------------')
print('โปรแกรมคำนวณผลคูณ')
print('-------------------------------')

while True:
    try:
       
        num1 = float(input("ป้อนตัวเลขตัวที่ 1: "))
        num2 = float(input("ป้อนตัวเลขตัวที่ 2: "))

      
        product = num1 * num2

        
        print(f"ผลคูณของ {num1} และ {num2} คือ {product}")

   
        if product > 5000:
            print("ผลคูณมากกว่า 5000 โปรแกรมจะหยุดทำงาน")
            break
    except ValueError:
        print("กรุณาป้อนตัวเลขให้ถูกต้อง")
